## Plan for org_account/organization
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_organizations_policy.aws_nuke_guardrails`                 |
|        | `aws_organizations_policy_attachment.Test-aws_nuke_guardrails` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_policy.aws_nuke_guardrails will be created
  + resource "aws_organizations_policy" "aws_nuke_guardrails" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:DeleteRole",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:iam::*:role/aws-service-role/*",
                          + "arn:aws:iam::*:role/AWSControlTower*",
                        ]
                      + Sid       = "ProtectAWSControlTowerRoles"
                    },
                  + {
                      + Action    = "iam:DeleteSAMLProvider"
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:iam::*:saml-provider/AWSSSO_*_DO_NOT_DELETE"
                      + Sid       = "ProtectSAMLProvider"
                    },
                  + {
                      + Action    = [
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:DeleteRole",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:iam::*:role/AWSReservedSSO_*"
                      + Sid       = "ProtectSSORoles"
                    },
                  + {
                      + Action    = [
                          + "iam:DetachRolePolicy",
                          + "iam:DeletePolicy",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:iam::*:policy/AWSReservedSSO_*"
                      + Sid       = "ProtectSSORolePolicies"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Control Tower Guardrails"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.Test-aws_nuke_guardrails will be created
  + resource "aws_organizations_policy_attachment" "Test-aws_nuke_guardrails" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-ectrrn9m"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.AFT"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.DumpsterFire"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Production"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.SRETools"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Security"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Test"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.aws_nuke_guardrails"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.cds_snc_universal_guardrails"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.qurantine_deny_all_policy"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
